app/controllers/produtos_controller.rb

    def index
        @produtos = Produto.order :nome
        @produto_menor_preco = Produto.order(:preco).limit 2
---
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 2]]

    def create
        valores = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade)
        @produto = Produto.new valores

        if @produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["nome", "Celular"], ["descricao", "Celular 2024"], ["preco", 4500.0], ["quantidade", 2], ["created_at", "2024-05-06 23:35:00.265843"], ["updated_at", "2024-05-06 23:35:00.265843"]]

    def destroy
        id = params[:id]
        Produto.destroy id
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 5]]

    def busca
        @nome_pesquisado = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome_pesquisado}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like '%Bo%s')